["Chuck Norris can set ants on fire with a magnifying glass. At night.<br>","They say curiosity killed the cat. This is false. Chuck Norris killed the cat. Every single one of them.<br>","In the beginning there was nothing...then Chuck Norris Roundhouse kicked that nothing in the face and said \"Get a job\". That is the story of the universe.<br>","In the beginning there was nothing...then Chuck Norris Roundhouse kicked that nothing in the face and said \"Get a job\". That is the story of the universe.<br>","Bill Gates thinks he's Chuck Norris. Chuck Norris actually laughed. Once.<br>","Chuck Norris is Charlie Sheen's dealer.<br>","Chuck Norris's beard can type 140 wpm.<br>","Chuck Norris's first program was kill -9.<br>","Chuck Norris doesn't take Viagra. But if he ever did, his penis could knock down a giant redwood tree.<br>","Much like a top fuel dragracer, Chuck Norris' penis is equipped with a parachute.<br>","Chuck Norris does not follow fashion trends, they follow him. But then he turns around and kicks their ass. Nobody follows Chuck Norris.<br>","Chuck Norris does not follow fashion trends, they follow him. But then he turns around and kicks their ass. Nobody follows Chuck Norris.<br>","A man once taunted Chuck Norris with a bag of Lay's potato chips, saying \"Betcha can't eat just one!\" Chuck Norris proceeded to eat the chips, the bag, and the man in one deft move.<br>","Chuck Norris doesn't eat, food climbs into his mouth out of fear.<br>","In the Words of Julius Caesar, \"Veni, Vidi, Vici, Chuck Norris\". Translation: I came, I saw, and I was roundhouse-kicked inthe face by Chuck Norris.<br>","After returning from World War 2 unscrathed, Bob Dole was congratulated by Chuck Norris with a handshake. The rest is history.<br>","Chuck Norris loans money back to his creditors at 6.87% (apr) above his borrowing rate from them. They then loan that money to the U.S. Gov't at a hansome profit. Then the lending banks file bankrupcy and the U.S. Gov't borrows money from China to bailout the U.S banks and China borrows money from Chuck Norris to loan to the U.S. Gov't. This is the world economy 2012. Confusing ain't it?<br>","Chuck Norris donates all of his money to the M.Y. Wallet foundation, and you better too, or else.<br>","A movie scene depicting Chuck Norris losing a fight with Bruce Lee was the product of history's most expensive visual effect. When adjusted for inflation, the effect cost more than the Gross National Product of Paraguay.<br>","Chuck Norris doesn't see dead people. He makes people dead.<br>","Who let the dogs out? Chuck Norris let the dogs out... and then roundhouse kicked them through an Oldsmobile.<br>","Who let the dogs out? Chuck Norris let the dogs out... and then roundhouse kicked them through an Oldsmobile.<br>","The Manhattan Project was not intended to create nuclear weapons, it was meant to recreate the destructive power in a Chuck Norris Roundhouse Kick. They didn't even come close.<br>","Chuck Norris is responsible for China's over-population. He hosted a Karate tournament in Beijing and all women within 1,000 miles became pregnant instantly.<br>","One day a jew accidently stepped on Chuck Norris his shoe. It was his favorite shoe. So Chuck created Hitler.<br>","In the Bible, Jesus turned water into wine. But then Chuck Norris turned that wine into beer.<br>","Chuck Norris eats lightning and shits out thunder.<br>","Chuck Norris once roundhouse kicked someone so hard that his foot broke the speed of light, went back in time, and killed Amelia Earhart while she was flying over the Pacific Ocean.<br>","When Chuck Norris works out on the Total Gym, the Total Gym feels like it's been raped.<br>","Chuck Norris was banned from competitive bullriding after a 1992 exhibition in San Antonio, when he rode the bull 1,346 miles from Texas to Milwaukee Wisconsin to pick up his dry cleaning.<br>","As an infant, Chuck Norris' parents gave him a toy hammer. He gave the world Stonehenge.<br>","Chuck Norris did in fact, build Rome in a day.<br>"]